Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The _LoggingCloudWatchConfig_ is building the bridge between the extension itself and the Quarkus application which uses the extension. It’s combining the _application.properties entries_ in the Quarkus application with our extension. That means with this class you can define the properties available in the _application.properties_ file and make the extension configurable from the outside. The _@ConfigRoot_ defines the prefix of the property in the _application.properties_ and the _@ConfigItems_ is the postfix. One application.properties entry we are accepting with this class is log.cloudwatch.enabled for example.
ja_jp: _LoggingCloudWatchConfig_は、エクステンション自体と、そのエクステンションを使用するQuarkusアプリケーションの間のブリッジを構築しています。このクラスは、Quarkusアプリケーションの _application.propertiesエントリ_をエクステンションと組み合わせています。つまり、このクラスでは、 _application.properties_ファイルで利用可能なプロパティを定義し、外部からエクステンションを設定できるようにしています。 _ConfigurationRoot_は _application.properties_内のプロパティのプレフィックスを、 _@ConfigItems_はポストフィックスを定義します。このクラスで受け付ける一つのapplication.propertiesエントリーは、例えばlog.cloudwatch.enabledです。

source: The _Movies_ will be serialized and deserialized using Avro. The schema, describing the _Movie_, is stored in Apicurio Registry. The same concept applies if you are using the Confluent Avro _serde_ and Confluent Schema Registry.
ja_jp: _Movies_ は、Avro を使用してシリアライズおよびデシリアライズされます。_Movie_ を記述するスキーマは、Apicurio Registry に保存されます。Confluent Avro _serde_ および Confluent Schema Registry を使用している場合も同じ概念が適用されます。

source: The _Movies_ will be serialized and deserialized using JSON Schema. The schema, describing the _Movie_, is stored in Apicurio Registry. The same concept applies if you are using the Confluent JSON Schema _serde_ and Confluent Schema Registry.
ja_jp: _Movies_ は、JSON スキーマを使用してシリアライズおよびデシリアライズされます。 _Movie_ を記述するスキーマは、Apicurio Registry に保存されます。 Confluent JSON Schema _serde_ および Confluent Schema Registry を使用している場合も、同じ概念が適用されます。

source: The _RUNTIME INIT_ stage happens after _STATIC INIT_. In this stage a `ConfigSource` can be initialized again. There are no restrictions at this stage, and a custom source is added to the `Config` instance as expected.
ja_jp: _RUNTIME INIT_ ステージは、 _STATIC INIT_ の後に起こります。このステージでは、 `ConfigSource` を再び初期化することができます。この段階では特に制限はなく、期待通りにカスタムソースが `Config` インスタンスに追加されます。

source: The _RUNTIME INIT_ stage happens after _STATIC INIT_. There are no restrictions at this stage, and any config mapping is added to the `Config` instance as expected.
ja_jp: _RUNTIME INIT_ ステージは、 _STATIC INIT_ の後に起こります。この段階では何の制限もなく、あらゆるコンフィグマッピングが期待通りに `Config` インスタンスに追加されます。

source: The _Reactive_ word is overloaded and associated with many concepts such as back-pressure, monads, or event-driven architecture. So, let's clarify what we mean by _Reactive_.
ja_jp: _リアクティブ_ という言葉は多重定義 (オーバーロード) されていて、バックプレッシャー、モナド、イベントドリブンアーキテクチャなど、多くの概念と関連付けられています。そこで、我々の _リアクティブ_ の意味を明確にしましょう。

source: The _WebSocket_ protocol, documented in the https://datatracker.ietf.org/doc/html/rfc6455[RFC6455], establishes a standardized method for creating a bidirectional communication channel between a client and a server through a single TCP connection. Unlike HTTP, WebSocket operates as a distinct TCP protocol but is designed to function seamlessly alongside HTTP. For example, it reuses the same ports and is compatible with the same security mechanisms.
ja_jp: https://datatracker.ietf.org/doc/html/rfc6455[RFC6455] に記載されている _WebSocket_ プロトコルは、単一の TCP 接続を介してクライアントとサーバー間の双方向通信チャネルを作成するための標準化された方法を確立します。 HTTP とは異なり、WebSocket は別個の TCP プロトコルとして動作しますが、HTTP とシームレスに連携して機能するように設計されています。 たとえば、同じポートを再利用し、同じセキュリティーメカニズムと互換性があります。

source: The _almost no magic_ approach
ja_jp: _ほとんどマジックがない_ アプローチ

source: The _customizer_ beans received the `VertxOptions` (coming from the application configuration), and can modify them.
ja_jp: _customizer_ Beanは、(アプリケーションの設定に由来する) `VertxOptions` を受け取り、それを修正することができます。

source: The _junit-virtual-threads_ also provides a `@ShouldPin` annotation for cases where pinning is unavoidable. The following snippet demonstrates the `@ShouldPin` annotation usage.
ja_jp: _junit-virtual-threads_ は、ピニングが避けられない場合のために `@ShouldPin` アノテーションも提供しています。 次のスニペットは、`@ShouldPin` アノテーションの使用法を示しています。

source: The _junit5-virtual-threads_ also provides a `@ShouldPin` annotation for cases where pinning is unavoidable. The following snippet demonstrates the `@ShouldPin` annotation usage.
ja_jp: _junit5-virtual-threadsは_ 、ピニングが避けられない場合のために `@ShouldPin` アノテーションも提供しています。 次のスニペットは `@ShouldPin` アノテーションの使い方を示しています。

source: The _liveness_ check captures any unrecoverable failure happening during the communication with Kafka.
ja_jp: _liveness_ チェックは、Kafka との通信中に発生する回復不可能なエラーをキャプチャーします。

source: The _method invokers_ implementation supports asynchronous methods. The following methods are considered asynchronous and `@Dependent` instances are only destroyed when the asynchronous action completes:
ja_jp: _メソッド呼び出し_ 実装は非同期メソッドをサポートします。 次のメソッドは非同期とみなされ、 `@Dependent` インスタンスは非同期アクションが完了したときにのみ破棄されます。

source: The _readiness_ check verifies that the Kafka connector is ready to consume/produce messages to the configured Kafka topics.
ja_jp: _readiness_ チェックは、Kafka コネクターが設定済みの Kafka トピックに対してメッセージを消費/生成する準備ができていることを確認します。

source: The _return_ value of a method annotated with `@ConsumeEvent` is used as response to the incoming message. For instance, in the following snippet, the returned `String` is the response.
ja_jp: `@ConsumeEvent` でアノテーションされたメソッドの _戻り値_ が、着信メッセージに対するレスポンスとして使用されます。例えば、次のスニペットでは、 `String` がレスポンスとして返されます。

source: The _return_ value of a method annotated with `@ConsumeEvent` is used to respond to the incoming message. For instance, in the following snippet, the returned `String` is the response.
ja_jp: `@ConsumeEvent` でアノテーションされたメソッドの _戻り_ 値は、受信したメッセージへの応答に使用されます。たとえば、次のスニペットでは、返された `String` が応答となります。

source: The _startup_ check verifies that the communication with Kafka cluster is established.
ja_jp: _startup_ check は、Kafka クラスターとの通信が確立されていることを確認します。

source: The `"<identifier>"` below is:
ja_jp: 以下の `"<identifier>"`:

source: The `$$*$$` wildcard at the end of the path matches zero or more path segments, but never any word starting from the `/public` path. For that reason, a path like `/public-info` is not matched by this pattern.
ja_jp: パスの末尾にある `$$*$$` ワイルドカードは、0 個以上のパスセグメントにマッチしますが、 `/public` パスから始まる単語にはマッチしません。 そのため、 `/public-info` のようなパスはこのパターンとはマッチしません。

source: The `$$*$$` wildcard at the end of the path matches zero or more path segments. The `$$*$$` wildcard placed anywhere else matches exactly one path segment.
ja_jp: パスの末尾にある `$$*$$` ワイルドカードは、0 個以上のパスセグメントにマッチします。 他の場所に配置された `$$*$$` ワイルドカードは、1 つのパスセグメントのみにマッチします。

source: The `${maven.multiModuleProjectDirectory}` will be resolved to the first directory that contains `.mvn` directory as its child going up the workspace file system tree starting from the current directory (or the one specified with the `-f` argument) from which the `mvn` command was launched. If the `.mvn` directory was not found, however, the `${maven.multiModuleProjectDirectory}` will be pointing to the directory from which the `mvn` command was launched (or the one targeted with the `-f` argument).
ja_jp: `${maven.multiModuleProjectDirectory}` は、 `mvn` コマンドが起動された現在のディレクトリー (または `-f` 引数で指定されたディレクトリー) から開始してワークスペースファイルシステムツリーを上る子として `.mvn` ディレクトリーを含む最初のディレクトリーに解決されます。ただし、 `.mvn` ディレクトリーが見つからなかった場合は、 `${maven.multiModuleProjectDirectory}` は、 `mvn` コマンドが起動されたディレクトリー (または `-f` 引数の対象となるディレクトリー) を指すようになります。

source: The `${session.topLevelProject.basedir.absolutePath}` will be pointing either to the directory from which the `mvn` command was launched or to the directory targeted with the `-f` argument, if it was specified.
ja_jp: `${session.topLevelProject.basedir.absolutePath}` は、 `mvn` コマンドが起動されたディレクトリー、または指定されている場合は `-f` 引数の対象となるディレクトリーのいずれかを指します。

source: The `%prod` prefix indicates that the property is only used when the application runs in prod mode (so not in dev or test). Refer to the xref:config-reference.adoc#profiles[Profile documentation] for further details.
ja_jp: `%prod` 接頭辞は、アプリケーションが本番モードで実行される場合にのみプロパティーが使用されることを示します (つまり、開発モードまたはテストモードでは使用されません)。詳細は、xref:config-reference.adoc#profiles[プロファイルに関するドキュメント] を参照してください。

source: The `--classpath` parameter needs to be set to the previously packaged JAR that contains your function class and all Quarkus related classes.
ja_jp: `--classpath` パラメーターには、関数クラスと Quarkus 関連のすべてのクラスを含む、先の手順でパッケージ化された JAR を指定する必要があります。

source: The `--data '{"data":"Hello, Pub/Sub"}'` option allow to specify the message to be send to PubSub.
ja_jp: `--data '{"data":"Hello, Pub/Sub"}'` オプションでは、メッセージが PubSub に送信されるようにできます。

source: The `--data '{"data":"Hello, Pub/Sub"}'` option allows you to specify the message to be sent to PubSub.
ja_jp: `--data '{"data":"Hello, Pub/Sub"}'` オプションでは、メッセージが PubSub に送信されるようにできます。

source: The `--data '{"name":"test.txt"}'` option allow to specify a fake file name, a fake Cloud Storage event will be created for this name.
ja_jp: `--data '{"name":"test.txt"}'` オプションでは、偽のファイル名を指定することができ、この名前に対して偽のクラウドストレージイベントが作成されます。

source: The `--tests \...` command line option selects given test(s) for continuous testing. The format is the same as the `gradle test --tests \...` https://docs.gradle.org/current/userguide/java_testing.html#test_filtering[format]. Specifically: the option can be passed multiple times, and each item is a simple pattern for the test class name and optionally a method name. When the pattern starts with an upper case letter, it matches a simple name of the class; otherwise, it matches a fully qualified name of the class. After the class name, separated by a period (`.`), a method name pattern may be included. The only wildcard character supported is `\*`, which matches an arbitrary number of characters. Note that `*` is based purely on text, it doesn't pay extra attention to package delimiters.
ja_jp: `--tests ...` コマンドラインオプションは、継続的テストのために指定されたテストを選択します。 書式は `gradle test --tests ...` link:https://docs.gradle.org/current/userguide/java_testing.html#test_filtering[と] 同じです。具体的には: オプションは複数回渡すことができ、それぞれの項目はテストのクラス名とオプションでメソッド名を表す単純なパターンです。 パターンが大文字で始まる場合はクラスの単純な名前にマッチし、そうでない場合はクラスの完全修飾名にマッチします。ピリオド ( `.` ) で区切られたクラス名の後に、メソッド名のパターンを含めることができます。ワイルドカード文字は `*` だけです。 `*` は純粋にテキストに基づいており、パッケージの区切り文字には特に注意を払っていないことに注意してください。

source: The `--trigger-bucket=` option defines the name of the Cloud Storage bucket.
ja_jp: `--trigger-bucket=` オプションは、Cloud Storage バケットの名称を定義します。

source: The `--trigger-resource` option defines the name of the Cloud Storage bucket, and the `--trigger-event google.storage.object.finalize` option define that this function will be triggered by all new file inside this bucket.
ja_jp: `--trigger-resource` オプションは Cloud Storage のバケット名を定義します。また、 `--trigger-event google.storage.object.finalize` オプションはこのバケット内のすべての新規ファイルに対してこの関数がトリガーされることを定義します。

source: The `--trigger-resource` option defines the name of the PubSub topic, and the `--trigger-event google.pubsub.topic.publish` option define that this function will be triggered by all message publication inside the topic.
ja_jp: `--trigger-resource` オプションは PubSub トピックの名前を定義し、 `--trigger-event google.pubsub.topic.publish` オプションは、この関数がトピック内のすべてのメッセージ公開によってトリガーされることを定義します。

source: The `-Djdk.tracePinnedThreads` dumps the stack trace if a virtual thread cannot be _unmounted_ smoothly (meaning that it blocks the carrier thread). That's what we call _pinning_ (more info in xref:./virtual-threads.adoc#pinning[the virtual thread reference guide]).
ja_jp: `-Djdk.tracePinnedThreads` は、仮想スレッドをスムーズに _アンマウント_ できない場合（キャリアスレッドをブロックすることを意味する）、スタックトレースをダンプします。 これが _pinning_ と呼ばれるものです（詳細は xref:./virtual-threads.adoc#pinning[仮想スレッドリファレンスガイド] を参照してください）。

source: The `-Djdk.tracePinnedThreads` system property **only works on Java 21-23**. It has been removed in Java 24+. For Java 24+, use the JFR events or Quarkus testing extensions instead (see the xref:./virtual-threads.adoc#testing-virtual-thread-applications[Testing virtual thread applications] section).
ja_jp: `-Djdk.tracePinnedThreads` システムプロパティーは **Java 21-23 でのみ動作します** 。 Java 24 以降では削除されています。Java 24 以降の場合は、代わりに JFR イベントまたは Quarkus テストエクステンションを使用してください ( xref:./virtual-threads.adoc#testing-virtual-thread-applications[仮想スレッドアプリケーションのテスト] セクションを参照)。

source: The `-Djdk.tracePinnedThreads` will detect pinned carrier threads while running tests (See xref:./virtual-threads.adoc#pinning[the virtual thread reference guide for details]).
ja_jp: `-Djdk.tracePinnedThreads` は、テスト実行中にピン留めされたキャリアスレッドを検出します（詳細については、 xref:./virtual-threads.adoc#pinning[仮想スレッドリファレンスガイド] を参照してください）。

source: The `-Djdk.tracePinnedThreads` will detect pinned carrier threads while running tests on Java 21-23 (See xref:./virtual-threads.adoc#pinning[the virtual thread reference guide for details]).
ja_jp: `-Djdk.tracePinnedThreads` は、Java 21-23 でテスト実行中にピン留めされたキャリアスレッドを検出します (詳細については、 xref:./virtual-threads.adoc#pinning[仮想スレッドリファレンスガイド] を参照してください)。

source: The `-Dquarkus.native.container-build=true` instructs Quarkus to build Linux 64bits native executables, who can run inside containers. Then, run the system using:
ja_jp: `-Dquarkus.native.container-build=true` は、コンテナー内で実行できる Linux 64 ビットのネイティブ実行可能ファイルをビルドするように Quarkus に指示します。次に、以下を使用してシステムを実行します。

source: The `-Dtest=\...` system property selects given test(s) for continuous testing. The format of this configuration property is the same as the Maven Surefire `-Dtest=\...` https://maven.apache.org/surefire/maven-surefire-plugin/test-mojo.html#test[format]. Specifically: it is a comma (`,`) separated list of globs of class file paths and/or method names. Each glob can potentially be prefixed with an exclamation mark (`!`), which makes it an exclusion filter instead of an inclusion filter. Exclusions have higher priority than inclusions. The class file path glob is separated from the method name glob by the hash sign (`#`) and multiple method name globs may be present, separated by the plus sign (`+`).
ja_jp: `-Dtest=...` システムプロパティは、継続的テストのために指定されたテストを選択します。 この設定プロパティの形式は、Maven Surefire `-Dtest=...` の link:https://maven.apache.org/surefire/maven-surefire-plugin/test-mojo.html#test[形式] と同じです。 具体的には、クラス・ファイル・パスおよび/またはメソッド名のグロブのカンマ ( `,` ) 区切りリストです。各グロブの先頭に感嘆符 ( `!` ) を付けることができます。除外は、包含よりも優先度が高くなります。クラス・ファイル・パス・グロブは、ハッシュ記号 ( `#` ) でメソッド名グロブと区切られ、プラス記号 ( `+` ) で区切られた複数のメソッド名グロブが存在する可能性があります。

source: The `-alias my.secret` option stores the configuration property name `my.secret` in the KeyStore with the value `DLTb_9zxThxeT5iAQqswEl5Dn1ju4FdM9hIyVip35t5V`. The `-storepass arealpassword` is the password required to access the keystore.
ja_jp: `-alias my.secret` オプションは、設定プロパティ名 `my.secret` を値 `DLTb_9zxThxeT5iAQqswEl5Dn1ju4FdM9hIyVip35t5V` と共にキーストアに格納します。 `-storepass arealpassword` は、キーストアにアクセスするために必要なパスワードです。

source: The `-junit5` extensions have been renamed to `-junit`, with relocations in place to avoid breaking existing projects. Use `quarkus update` to get them updated automatically.
ja_jp: `quarkus-junit5` エクステンションは `-junit` に名前が変更されました。既存のプロジェクトを壊さないようにリロケーションが設定されています。 `quarkus update` を使用して自動的に更新してください。

source: The `.` symbol separates the specific parts in the configuration property. The quotes in the property name are used as a required escape to keep category specifications, such as `quarkus.log.category."io.quarkus.smallrye.jwt".level=TRACE`, intact.
ja_jp: `.` 記号は、設定プロパティ内の特定の部分を区切ります。 プロパティ名の引用符は、 `quarkus.log.category."io.quarkus.smallrye.jwt".level=TRACE` のようなカテゴリ指定をそのまま維持するための必須エスケープとして使用されます。

source: The `.env` file does not contain the `quarkus.tls.lets-encrypt.enabled` and `quarkus.management.enabled` properties as they are build-time properties that require a rebuild of the application.
ja_jp: `quarkus.tls.lets-encrypt.enabled` プロパティーと `quarkus.management.enabled` プロパティーは、アプリケーションの再構築を必要とするビルド時のプロパティーであるため、`.env` ファイルには含まれません。

source: The `.onItem().transform(...)` can be replaced with `.map(...)`. `map` is a shortcut.
ja_jp: `.onItem().transform(…​)` は `.map(…​)` に置き換えることができます。 `map` はショートカットです。

source: The `.redis` file follows a _one command per line_ format:
ja_jp: `.redis` ファイルは、 _1行に1コマンド_ の形式をとっています:

source: The `/*` path is not secured. You must secure your endpoints with standard security annotations or define HTTP permissions in addition to this configuration property.
ja_jp: `/*` パスは保護されていません。標準のセキュリティーアノテーションを使用してエンドポイントを保護するか、この設定プロパティーに加えて HTTP 権限を定義する必要があります。

source: The `/*` path is secured, only authenticated HTTP requests are granted access.
ja_jp: `/*` パスは保護されており、認証された HTTP リクエストのみにアクセスが許可されます。

source: The `/api/admin` endpoint is protected with RBAC (Role-Based Access Control) and only users granted with the `admin` role can access it.
ja_jp: `/api/admin` エンドポイントは RBAC (役割ベースのアクセス制御) で保護されており、 `admin` の役割を付与されたユーザーのみがアクセスできます。

source: The `/api/admin` endpoint is protected with RBAC (Role-Based Access Control) where only users granted with the `admin` role can access. At this endpoint, we use the `@RolesAllowed` annotation to declaratively enforce the access constraint.
ja_jp: `/api/admin` エンドポイントは RBAC (Role-Based Access Control) で保護されており、 `admin` ロールで許可されたユーザーのみがアクセスできます。このエンドポイントでは、 `@RolesAllowed` アノテーションを使用して、アクセス制約を宣言的に強制します。

source: The `/api/admin` endpoint is protected with RBAC (Role-Based Access Control), which only users with the `admin` role can access. At this endpoint, the `@RolesAllowed` annotation is used to enforce the access constraint declaratively.
ja_jp: `/api/admin` エンドポイントは RBAC (ロールベースのアクセス制御) で保護されており、`admin` ロールを持つユーザーのみがアクセスできます。 このエンドポイントでは、`@RolesAllowed` アノテーションを使用して、アクセス制約を宣言的に適用します。

source: The `/api/admin` endpoint is protected with role-based access control (RBAC), and only users who have been granted the `admin` role can access it. At this endpoint, the `@RolesAllowed` annotation is used to declaratively enforce the access constraint.
ja_jp: `/api/admin` のエンドポイントは RBAC で保護されており、 `admin` のロールを付与されたユーザーのみがアクセスすることができます。 このエンドポイントでは、アクセス制約を宣言的に課すために `@RolesAllowed` アノテーションが使用されています。

source: The `/api/public` endpoint can be accessed anonymously.
ja_jp: `/api/public` エンドポイントには匿名でアクセスすることができます。

source: The `/api/public` endpoint can be accessed anonymously. The `/api/admin` endpoint is protected with RBAC (Role-Based Access Control) where only users granted with the `adminRole` role can access. At this endpoint, we use the `@RolesAllowed` annotation to declaratively enforce the access constraint. The `/api/users/me` endpoint is also protected with RBAC (Role-Based Access Control) where only users granted with the `standardRole` role can access. As a response, it returns a JSON document with details about the user.
ja_jp: `/api/public` エンドポイントは匿名でアクセスできます。 `/api/admin` エンドポイントは RBAC (Role-Based Access Control) で保護されており、 `adminRole` ロールで許可されたユーザーのみがアクセスできます。このエンドポイントでは、 `@RolesAllowed` アノテーションを使用して、アクセス制約を宣言的に強制します。 `/api/users/me` エンドポイントも RBAC (Role-Based Access Control) で保護されており、 `standardRole` ロールで付与されたユーザーのみがアクセスできます。レスポンスとして、ユーザーに関する詳細を含むJSONドキュメントを返します。

source: The `/api/public` endpoint can be accessed anonymously. The `/api/admin` endpoint is protected with RBAC (Role-Based Access Control) where only users granted with the `admin` role can access. At this endpoint, we use the `@RolesAllowed` annotation to declaratively enforce the access constraint. The `/api/users/me` endpoint is also protected with RBAC (Role-Based Access Control) where only users granted with the `user` role can access. As a response, it returns a JSON document with details about the user.
ja_jp: `/api/public` エンドポイントは匿名でアクセスできます。 `/api/admin` エンドポイントは RBAC (Role-Based Access Control) で保護されており、 `admin` の役割を与えられたユーザーのみがアクセスできます。このエンドポイントでは、 `@RolesAllowed` アノテーションを使用して、アクセス制約を宣言的に強制します。 `/api/users/me` エンドポイントも RBAC (Role-Based Access Control) で保護されており、 `user` ロールで付与されたユーザーのみがアクセスできます。レスポンスとして、ユーザーに関する詳細を含むJSONドキュメントを返します。

source: The `/api/public` endpoint can be accessed anonymously. The `/api/public/me` endpoint can be accessed anonymously and returns the current username if there is one, or `<not logged in>` if not. The `/api/admin` endpoint is protected with RBAC (Role-Based Access Control) where only users granted with the `admin` role can access. At this endpoint, we use the `@RolesAllowed` annotation to declaratively enforce the access constraint. The `/api/users/me` endpoint is also protected with RBAC (Role-Based Access Control) where only users granted with the `user` role can access. As a response, it returns a JSON document with details about the user.
ja_jp: `/api/public` エンドポイントは匿名でアクセスすることができます。 `/api/public/me` エンドポイントは匿名でアクセスでき、現在のユーザー名がある場合はそのユーザー名を、ない場合は `<not logged in>` を返します。 `/api/admin` エンドポイントは RBAC (ロールベースのアクセス制御) で保護されており、 `admin` のロールを与えられたユーザーのみがアクセスできます。このエンドポイントでは、 `@RolesAllowed` アノテーションを使用して、アクセス制約を宣言的に適用します。 `/api/users/me` エンドポイントも RBAC (ロールベースのアクセス制御) で保護されており、 `user` ロールが付与されたユーザのみがアクセスできるようになっています。レスポンスとして、ユーザーに関する詳細情報を含む JSON ドキュメントが返されます。

source: The `/api/users/me` endpoint can be accessed by any user with a valid token. As a response, it returns a JSON document with details about the user where these details are obtained from the information carried on the token. This endpoint is protected with RBAC (Role-Based Access Control) and only users granted with the `user` role can access this endpoint.
ja_jp: `/api/users/me` エンドポイントは、有効なトークンを持つ任意のユーザーがアクセスできます。応答として、ユーザーに関する詳細が記載された JSON ドキュメントを返却します。このエンドポイントは RBAC (Role-Based Access Control) で保護されており、 `user` のロールで許可されたユーザーのみがこのエンドポイントにアクセスできます。

source: The `/api/users/me` endpoint can be accessed by any user with a valid token. As a response, it returns a JSON document with details about the user where these details are obtained from the information carried on the token.
ja_jp: `/api/users/me` エンドポイントは、有効なトークンを持つ任意のユーザーがアクセスできます。レスポンスとして、トークンに記録されている情報から取得したユーザーの詳細を含む JSON ドキュメントを返します。

source: The `/api/users/me` endpoint is protected with RBAC and only users that have been granted the `user` role can access it. A JSON document with details about the user is returned as a response.
ja_jp: `/api/users/me` のエンドポイントは RBAC で保護されており、 `user` のロールを付与されたユーザーのみがアクセスすることができます。ユーザーに関する詳細情報を含む JSON ドキュメントがレスポンスとして返されます。

source: The `/forbidden/` path is not secured.
ja_jp: `/forbidden/` パスは保護されていません。

source: The `/hello/basic` endpoint requires authentication, because when no standard security annotation accompanies the `@BasicAuthentication` annotation, the `@Authenticated` annotation is added by default.
ja_jp: `/hello/basic` エンドポイントには認証が必要です。なぜなら、標準のセキュリティーアノテーションが `@BasicAuthentication` アノテーションに付随しない場合、デフォルトで `@Authenticated` アノテーションが追加されるためです。

source: The `/hello/custom` endpoint requires authentication, because when no standard security annotation accompanies the `@HttpAuthenticationMechanism` annotation, the `@Authenticated` annotation is added by default.
ja_jp: `/hello/custom` エンドポイントには認証が必要です。なぜなら、標準のセキュリティーアノテーションが `@HttpAuthenticationMechanism` アノテーションに付随しない場合、デフォルトで `@Authenticated` アノテーションが追加されるためです。

source: The `/library/*` path can be tested from a Keycloak provider Dev UI page, because the user `alice` which is created automatically by the xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] has an `admin` role.
ja_jp: `/library/*`パスは Keycloak プロバイダーの Dev UI ページからテストできます。これは、xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] によって自動的に作成されたユーザー`alice` に `admin` ロールが付与されるためです。

source: The `/programmatic-way` sub-path checks only for the `Scope Permission Resource` permission by default. However, you can enforce additional constraints, such as scope requirements, by using `SecurityIdentity#checkPermission`.
ja_jp: `/programmatic-way` サブパスは、デフォルトでは `Scope Permission Resource` 権限のみをチェックします。ただし、 `SecurityIdentity#checkPermission` を使用して、スコープ要件などの追加の制約を適用できます。
